## Exploring Sales Data from a youtube video

Video Link Here:
https://www.youtube.com/watch?v=eMOA1pPVUc4

We have forked a branch from the github repo. Link here: https://github.com/KeithGalli/Pandas-Data-Science-Tasks

In [107]:
import numpy as np
import pandas as pd
import os
import datetime as dt

print("pandas version: " + pd.__version__)

#nicer display of tables, display all output
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

pandas version: 1.0.3

In [110]:
#setup the folders
dir_data = r'Sales_Data'
dir_out  = r'Output'

Import and combine the csv files in the directory

In [111]:

#init the df for merging
df_all =pd.DataFrame()

for file in os.listdir(dir_data):
    if file.endswith(".csv"):
        #print out the list of csv files in the directory, 
        #print(os.path.join(dir_data, file))
        
        #import and append
        data_in = pd.read_csv(dir_data + "/" +file , na_values="")
        #print(data_in.head())
        df_all = pd.concat([df_all, data_in])

df_all.info()
print("\n")
print("column names:")
df_all.columns

<class 'pandas.core.frame.DataFrame'>
Int64Index: 186850 entries, 0 to 13621
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
dtypes: object(6)
memory usage: 10.0+ MB


column names:

Index(['Order ID', 'Product', 'Quantity Ordered', 'Price Each', 'Order Date',
       'Purchase Address'],
      dtype='object')

Find NA Values

In [112]:
df_all.isna().sum()

Order ID            545
Product             545
Quantity Ordered    545
Price Each          545
Order Date          545
Purchase Address    545
dtype: int64

In [113]:
df_all.isna().head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False

Drop the rows with NA

Count rows where there are valid rows

In [114]:
len(df_all[df_all.isna()!=True])

186850

In [115]:
#create a dataframe with NA values for a check
nan_df = df_all[df_all.isna().any(axis=1)]
nan_df.head()

     Order ID Product Quantity Ordered Price Each Order Date Purchase Address
264       NaN     NaN              NaN        NaN        NaN              NaN
648       NaN     NaN              NaN        NaN        NaN              NaN
680       NaN     NaN              NaN        NaN        NaN              NaN
1385      NaN     NaN              NaN        NaN        NaN              NaN
1495      NaN     NaN              NaN        NaN        NaN              NaN

Drop the rows with NA and check the row counts

In [116]:
df_clean = df_all[df_all.isna()!=True]

In [117]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 186850 entries, 0 to 13621
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
dtypes: object(6)
memory usage: 10.0+ MB

In [118]:
df_clean.describe()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
count,186305,186305,186305,186305,186305,186305
unique,178438,20,10,24,142396,140788
top,Order ID,USB-C Charging Cable,1,11.95,Order Date,Purchase Address
freq,355,21903,168552,21903,355,355

In [119]:
df_clean["Order Date"].head()

0    12/30/19 00:01
1    12/29/19 07:03
2    12/12/19 18:21
3    12/22/19 15:13
4    12/18/19 12:38
Name: Order Date, dtype: object

In [120]:
#test the conversion format
test = pd.to_datetime("12/30/19 00:01",format='%m/%d/%y %H:%M')
test

Timestamp('2019-12-30 00:01:00')

In [121]:
#convert the order date to datetime format
df_clean['datetime']= pd.to_datetime(df_clean["Order Date"], format='%m/%d/%y %H:%M', errors='coerce')

In [122]:
df_clean['datetime'].head()

0   2019-12-30 00:01:00
1   2019-12-29 07:03:00
2   2019-12-12 18:21:00
3   2019-12-22 15:13:00
4   2019-12-18 12:38:00
Name: datetime, dtype: datetime64[ns]

In [123]:
df_clean.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,datetime
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001",2019-12-30 00:01:00
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001",2019-12-29 07:03:00
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001",2019-12-12 18:21:00
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016",2019-12-22 15:13:00
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301",2019-12-18 12:38:00

Check the Data types

In [86]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 186850 entries, 0 to 13621
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
 6   datetime          185950 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(6)
memory usage: 11.4+ MB

Let's convert the columns with values to numeric form

In [87]:
df_clean['Quantity Ordered'] = pd.to_numeric(df_clean['Quantity Ordered'])

ValueError: Unable to parse string "Quantity Ordered" at position 254

Let's see why the conversion fails

In [124]:
df_clean.iloc[254]

Order ID                    Order ID
Product                      Product
Quantity Ordered    Quantity Ordered
Price Each                Price Each
Order Date                Order Date
Purchase Address    Purchase Address
datetime                         NaT
Name: 254, dtype: object

We have multiple headers as we imported all the files with their headers

1. Check how many header rows should be removed

2. Let's remove all header rows from the data set

In [125]:
df_clean[df_clean["Order ID"] =="Order ID"]

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,datetime
254,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,NaT
705,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,NaT
1101,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,NaT
2875,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,NaT
3708,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,NaT
...,...,...,...,...,...,...,...
10443,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,NaT
10784,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,NaT
10813,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,NaT
11047,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,NaT
13304,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,NaT

In [126]:
print("how many rows contain a header row:")
len(df_clean) - len(df_clean[df_clean["Order ID"] !="Order ID"])

how many rows contain a header row:

355

In [127]:
#re-assign the data 
# we use a copy to remove the error -- https://www.dataquest.io/blog/settingwithcopywarning/
df_clean = df_clean[df_clean["Order ID"] !="Order ID"].copy()

Lets try the type conversion again

In [128]:
df_clean['Quantity Ordered'] = pd.to_numeric(df_clean['Quantity Ordered'])

Print out sample rows

In [129]:
df_clean.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,datetime
0,295665,Macbook Pro Laptop,1.0,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001",2019-12-30 00:01:00
1,295666,LG Washing Machine,1.0,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001",2019-12-29 07:03:00
2,295667,USB-C Charging Cable,1.0,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001",2019-12-12 18:21:00
3,295668,27in FHD Monitor,1.0,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016",2019-12-22 15:13:00
4,295669,USB-C Charging Cable,1.0,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301",2019-12-18 12:38:00

Lets convert the rest of the columns

In [130]:
df_clean['Price Each'] = pd.to_numeric(df_clean['Price Each'])

In [131]:
df_clean['Product'] = df_clean['Product'].astype(str)

Drop the original Order Date since we have converted the date already

In [132]:
df_clean.drop("Order Date" , axis=1, inplace=True)

In [133]:
df_clean.head()

,Order ID,Product,Quantity Ordered,Price Each,Purchase Address,datetime
0,295665,Macbook Pro Laptop,1.0,1700.00,"136 Church St, New York City, NY 10001",2019-12-30 00:01:00
1,295666,LG Washing Machine,1.0,600.00,"562 2nd St, New York City, NY 10001",2019-12-29 07:03:00
2,295667,USB-C Charging Cable,1.0,11.95,"277 Main St, New York City, NY 10001",2019-12-12 18:21:00
3,295668,27in FHD Monitor,1.0,149.99,"410 6th St, San Francisco, CA 94016",2019-12-22 15:13:00
4,295669,USB-C Charging Cable,1.0,11.95,"43 Hill St, Atlanta, GA 30301",2019-12-18 12:38:00

Let's have a quick look at the data to see if there are any missing values

In [136]:
df_clean.describe()
df_clean.info()

       Quantity Ordered     Price Each
count     185950.000000  185950.000000
mean           1.124383     184.399735
std            0.442793     332.731330
min            1.000000       2.990000
25%            1.000000      11.950000
50%            1.000000      14.950000
75%            1.000000     150.000000
max            9.000000    1700.000000

<class 'pandas.core.frame.DataFrame'>
Int64Index: 186495 entries, 0 to 13621
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           186495 non-null  object
 2   Quantity Ordered  185950 non-null  float64
 3   Price Each        185950 non-null  float64
 4   Purchase Address  185950 non-null  object
 5   datetime          185950 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(3)
memory usage: 10.0+ MB

After the type conversion, the describe function is showing values instead of counts. Let's save a copy of this data and move to the EDA process.

Make a copy of the combined dataframe

In [113]:
df_clean.to_csv(dir_out + "/cleaned_data.csv")